app/views/posts/_form.html.erb

	<% @post.tags.build if @post.tags.empty? %>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `tags` WHERE (`tags`.post_id = 980190962)) AS subquery
SELECT `tags`.* FROM `tags` WHERE (`tags`.post_id = 980190963)