app/views/posts/show.html.erb

<h2>Comments</h2>
<% @post.comments.each do |c| %>
---
SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 298486374)