app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 980190963) AND (`comments`.`id` = 980190968) LIMIT 1
---
  def show
    @comment = @post.comments.find(params[:id])

INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('fdasfsa', 'fdsafsfsafas', 980190963, '2010-12-15 11:44:12', '2010-12-15 11:44:12')
---
  def create
    @comment = @post.comments.build(params[:comment])
    if @comment.save

SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 11) AND (`comments`.`id` = 7) LIMIT 1
---
  def edit
    @comment = @post.comments.find(params[:id])

SELECT `comments`.* FROM `comments` WHERE (`comments`.`id` = 980190963) LIMIT 1
DELETE FROM `comments` WHERE (`comments`.`id` = 980190963)
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 980190963) LIMIT 1
---
    def find_post
      @post = Post.find(params[:post_id])