app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts`

  def destroy
      @post = Post.find(params[:id])
      @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 980190962) LIMIT 1
DELETE FROM `posts` WHERE (`posts`.`id` = 980190962)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `title`, `content`, `created_at`, `updated_at`) VALUES ('fadfdsaf', 'fdsffdsaf', 'fdasfaf', '2010-12-15 12:16:51', '2010-12-15 12:16:51')

  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE `posts` SET `content` = 'fdsafsaffsfd', `updated_at` = '2010-12-15 11:32:53' WHERE (`posts`.`id` = 980190963)

    def find_post
      @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 980190962) LIMIT 1