app/controllers/users_controller.rb

INSERT INTO `users` (`user`, `mail`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`) VALUES ('bore', 'bore@gmail.com', '055615471a4476fa76005dcd309b200f0b0b84ca438df3617d4bf0e3e5e727f8bea59c1afd7725838759a9e30c2eabe0327913a2a991ea3d728049e9b694e77a', 'jRyA4A3tLPU6T4GIpIb', 'c7fe30546a801ce862255ae8e84837952f3bb4733be02872df86441bad2971c973e63b2266005ca874d19b21103d097d7ff8dbaafd0bcf2541d717bc931279f4', '2010-12-27 09:41:34', '2010-12-27 09:41:34')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 7) LIMIT 1
---
  def show
      @user = User.find(params[:id])